; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v4 - type_2 ?v6 - type_1)
 	      (pred_2 ?v5 - object ?v6 - type_1)
	      (pred_4 ?v4 - type_2 ?v1 - type_3)
	      (pred_1 ?v4 - type_2 ?v5 - object ?v1 - type_3))

   (:action op_1
       :parameters  (?v4 - type_2 ?v3 ?v8 - type_1)
       :precondition (and  (pred_3 ?v4 ?v3))
       :effect (and  (pred_3 ?v4 ?v8)
		     (not (pred_3 ?v4 ?v3))))

   (:action op_3
       :parameters (?v4 - type_2 ?v7 - object ?v2 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v2) (pred_3 ?v4 ?v2) (pred_4 ?v4 ?v1))
       :effect (and (pred_1 ?v4 ?v7 ?v1)
		    (not (pred_2 ?v7 ?v2)) 
		    (not (pred_4 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_2 ?v7 - object ?v2 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v7 ?v1) (pred_3 ?v4 ?v2))
       :effect (and (pred_2 ?v7 ?v2)
		    (pred_4 ?v4 ?v1)
		    (not (pred_1 ?v4 ?v7 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_12 obj_08 - type_2
obj_09 obj_06 obj_07 obj_11 - type_3
obj_13 obj_10 obj_02 obj_01 - type_1
obj_14 obj_05 obj_04 obj_03 - object)
(:init
(pred_3 obj_12 obj_01)
(pred_4 obj_12 obj_09)
(pred_4 obj_12 obj_06)
(pred_3 obj_08 obj_02)
(pred_4 obj_08 obj_07)
(pred_4 obj_08 obj_11)
(pred_2 obj_14 obj_13)
(pred_2 obj_05 obj_13)
(pred_2 obj_04 obj_13)
(pred_2 obj_03 obj_02)
)
(:goal
(and
(pred_2 obj_14 obj_13)
(pred_2 obj_05 obj_10)
(pred_2 obj_04 obj_02)
(pred_2 obj_03 obj_02)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_12 obj_02) (pred_3 obj_08 obj_02))))
  )
)
)

; plan
1. (op_1 obj_12 obj_01 obj_10)
   deleted: (pred_3 obj_12 obj_01)
   added: (pred_3 obj_12 obj_10)
   goals met: 2 of 4
2. (op_1 obj_08 obj_02 obj_13)
   deleted: (pred_3 obj_08 obj_02)
   added: (pred_3 obj_08 obj_13)
   goals met: 2 of 4
3. (op_3 obj_08 obj_04 obj_13 obj_11)
   deleted: (pred_2 obj_04 obj_13) (pred_4 obj_08 obj_11)
   added: (pred_1 obj_08 obj_04 obj_11)
   goals met: 2 of 4
4. (op_3 obj_08 obj_05 obj_13 obj_07)
   deleted: (pred_2 obj_05 obj_13) (pred_4 obj_08 obj_07)
   added: (pred_1 obj_08 obj_05 obj_07)
   goals met: 2 of 4
5. (op_1 obj_08 obj_13 obj_10)
   deleted: (pred_3 obj_08 obj_13)
   added: (pred_3 obj_08 obj_10)
   goals met: 2 of 4
6. (op_2 obj_08 obj_05 obj_10 obj_07)
   deleted: (pred_1 obj_08 obj_05 obj_07)
   added: (pred_2 obj_05 obj_10) (pred_4 obj_08 obj_07)
   goals met: 3 of 4
7. (op_1 obj_08 obj_10 obj_02)
   deleted: (pred_3 obj_08 obj_10)
   added: (pred_3 obj_08 obj_02)
   goals met: 3 of 4
8. (op_2 obj_08 obj_04 obj_02 obj_11)
   deleted: (pred_1 obj_08 obj_04 obj_11)
   added: (pred_2 obj_04 obj_02) (pred_4 obj_08 obj_11)
   goals met: 4 of 4
